{
    "background_image": "https://img.freepik.com/premium-photo/utilizing-3d-printing-technology-modern-workplace_236854-65269.jpg",
    "glassiness_strength": 0.5,
    "testing_mode": true,
    "filaments": [
        {
            "id": "pla",
            "name": "PLA",
            "description": "Our most popular and versatile filament, PLA is derived from renewable resources and is biodegradable. It's easy to print, offers excellent detail, and is ideal for models, prototypes, and low-stress functional parts. Not suitable for high temperatures or outdoor use.",
            "hardness_shore_d": 65,
            "base_price_per_gram": 0.10,
            "colors": ["#FFFFFF", "#000000", "#808080", "#FF0000", "#0000FF", "#008000", "#FFFF00", "#f5f5dc"]
        },
        {
            "id": "petg",
            "name": "PETG",
            "description": "PETG combines the ease of use of PLA with the strength and durability of ABS. It offers good layer adhesion, chemical resistance, and can withstand higher temperatures than PLA. Ideal for functional parts, mechanical components, and outdoor applications.",
            "hardness_shore_d": 75,
            "base_price_per_gram": 0.12,
            "colors": ["#E0FFFF", "#000000", "#FFFFFF", "#0000FF"]
        },
        {
            "id": "asa",
            "name": "ASA",
            "description": "ASA is an excellent weather-resistant alternative to ABS, offering superior UV stability and outdoor durability. It shares many properties with ABS, including strength and heat resistance, but with much less warping during printing. Ideal for outdoor functional parts, automotive components, and marine applications.",
            "hardness_shore_d": 100,
            "base_price_per_gram": 0.18,
            "colors": ["#008080", "#C0C0C0"]
        },
        {
            "id": "abs",
            "name": "ABS",
            "description": "Known for its strength, toughness, and temperature resistance, ABS is a classic engineering plastic. It's more challenging to print due to warping, but provides durable and rigid parts suitable for robust applications and post-processing like sanding and painting. Best for indoor use.",
            "hardness_shore_d": 105,
            "base_price_per_gram": 0.18,
            "colors": ["#000000", "#FFFFFF"]
        }
    ]
}
